voicepad/app/controllers/folders_controller.rb

  def index
    @folders = Folder.all
---
SELECT "folders".* FROM "folders"