voicepad/app/controllers/folders_controller.rb

SELECT "folders".* FROM "folders" ORDER BY "folders"."id" ASC
SELECT "notes".* FROM "notes" WHERE "notes"."folder_id" = $1  [["folder_id", 1]]
---
  def index

    @folders = Folder.order(:id)
    # @note = Note.new
    @notes = Note.order(:id)

INSERT INTO "folders" ("foldername", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["foldername", "kjbkj"], ["created_at", "2017-06-18 18:56:00.543069"], ["updated_at", "2017-06-18 18:56:00.543069"]]
SELECT "folders".* FROM "folders" ORDER BY "folders"."id" ASC
---
    def create
        begin
        @folder = Folder.new(folder_params)
        @folder.save
        @all_folders = Folder.order(:id)

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "folders" SET "foldername" = $1, "updated_at" = $2 WHERE "folders"."id" = $3  [["foldername", "sssss"], ["updated_at", "2017-06-19 06:41:58.922406"], ["id", 2]]
---
  def update
    begin
      @folder = Folder.find(params[:id])
      @folder.update(folder_params)

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 5]]
SELECT "folders".* FROM "folders" ORDER BY "folders"."id" ASC
---
  def destroy
    begin
      @folder = Folder.find(params[:id])
      @folder.destroy
      @all_folders = Folder.order(:id)

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_folder
        @folder = Folder.find(params[:id])